# Material Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPart..::..Material Property
FabricationPart Class See Also
---
The fabrication material identifier.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public int Material { get; set; }
```

Visual Basic
---
```text
Public Property Material As Integer
	Get
	Set
```

Visual C++
---
```text
public:
property int Material {
	int get ();
	void set (int value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: the material is not valid for the fabrication part's specification. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | When setting this property: the material is not able to be modified. -or- When setting this property: the fabrication part is connected to more than one item. -or- When setting this property: the material fails to be set by identifier: materialId. |

# See Also
FabricationPart Class
Autodesk.Revit.DB Namespace